

Network Working Group                                          M. Barnes
Internet-Draft                                                  F. Audet
Obsoletes: RFC4244                                                Nortel
(if approved)                                              June 11, 2009
Intended status: Standards Track
Expires: December 13, 2009


   An Extension to the Session Initiation Protocol (SIP) for Request
                          History Information
                 draft-barnes-sipcore-rfc4244bis-01.txt

Status of this Memo

   This Internet-Draft is submitted to IETF in full conformance with the
   provisions of BCP 78 and BCP 79.  This document may contain material
   from IETF Documents or IETF Contributions published or made publicly
   available before November 10, 2008.  The person(s) controlling the
   copyright in some of this material may not have granted the IETF
   Trust the right to allow modifications of such material outside the
   IETF Standards Process.  Without obtaining an adequate license from
   the person(s) controlling the copyright in such materials, this
   document may not be modified outside the IETF Standards Process, and
   derivative works of it may not be created outside the IETF Standards
   Process, except to format it for publication as an RFC or to
   translate it into languages other than English.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on December 13, 2009.

Copyright Notice

   Copyright (c) 2009 IETF Trust and the persons identified as the



Barnes & Audet          Expires December 13, 2009               [Page 1]

Internet-Draft                History-Info                     June 2009


   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents in effect on the date of
   publication of this document (http://trustee.ietf.org/license-info).
   Please review these documents carefully, as they describe your rights
   and restrictions with respect to this document.

Abstract

   This document defines a standard mechanism for capturing the history
   information associated with a Session Initiation Protocol (SIP)
   request.  This capability enables many enhanced services by providing
   the information as to how and why a call arrives at a specific
   application or user.  This document defines a new optional SIP
   header, History-Info, for capturing the history information in
   requests.


































Barnes & Audet          Expires December 13, 2009               [Page 2]

Internet-Draft                History-Info                     June 2009


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  4
     1.1.  Overview . . . . . . . . . . . . . . . . . . . . . . . . .  4
     1.2.  Conventions and Terminology  . . . . . . . . . . . . . . .  4
     1.3.  Background: Why define a Generic Request History
           Header?  . . . . . . . . . . . . . . . . . . . . . . . . .  5
   2.  Request History Requirements . . . . . . . . . . . . . . . . .  6
     2.1.  Security Requirements  . . . . . . . . . . . . . . . . . .  7
     2.2.  Privacy Requirements . . . . . . . . . . . . . . . . . . .  8
   3.  Request History Information Description  . . . . . . . . . . .  8
     3.1.  Optionality of History-Info  . . . . . . . . . . . . . . .  9
     3.2.  Ensuring the Privacy of History-Info . . . . . . . . . . .  9
   4.  Request History Information Protocol Details . . . . . . . . . 10
     4.1.  Protocol Structure of History-Info . . . . . . . . . . . . 10
     4.2.  Protocol Examples  . . . . . . . . . . . . . . . . . . . . 13
     4.3.  Protocol Usage . . . . . . . . . . . . . . . . . . . . . . 13
       4.3.1.  User Agent Client (UAC) Behavior . . . . . . . . . . . 14
       4.3.2.  User Agent Server (UAS) Behavior . . . . . . . . . . . 15
       4.3.3.  Proxy Behavior . . . . . . . . . . . . . . . . . . . . 15
       4.3.4.  Redirect Server Behavior . . . . . . . . . . . . . . . 19
     4.4.  Example Call Flows with History-Info Header  . . . . . . . 20
       4.4.1.  Basic Call with History-Info . . . . . . . . . . . . . 20
       4.4.2.  History-Info with Privacy Header . . . . . . . . . . . 21
       4.4.3.  Privacy Header for a Specific History-Info Entry . . . 23
   5.  Application Considerations . . . . . . . . . . . . . . . . . . 24
   6.  Security Considerations  . . . . . . . . . . . . . . . . . . . 25
   7.  IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 26
     7.1.  Registration of New SIP History-Info Header  . . . . . . . 26
     7.2.  Registration of "history" for SIP Privacy Header . . . . . 27
   8.  Contributors . . . . . . . . . . . . . . . . . . . . . . . . . 27
   9.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 27
   10. Changes since last Version . . . . . . . . . . . . . . . . . . 27
   11. References . . . . . . . . . . . . . . . . . . . . . . . . . . 29
     11.1. Normative References . . . . . . . . . . . . . . . . . . . 29
     11.2. Informative References . . . . . . . . . . . . . . . . . . 30
   Appendix A.  Detailed call flows . . . . . . . . . . . . . . . . . 30
     A.1.  Sequentially Forking (History-Info in Response)  . . . . . 30
     A.2.  Voicemail  . . . . . . . . . . . . . . . . . . . . . . . . 38
     A.3.  Automatic Call Distribution  . . . . . . . . . . . . . . . 40
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 42










Barnes & Audet          Expires December 13, 2009               [Page 3]

Internet-Draft                History-Info                     June 2009


1.  Introduction

1.1.  Overview

   Many services that SIP is anticipated to support require the ability
   to determine why and how the call arrived at a specific application.
   Examples of such services include (but are not limited to) sessions
   initiated to call centers via "click to talk" SIP Uniform Resource
   Locators (URLs) on a web page, "call history/logging" style services
   within intelligent "call management" software for SIP User Agents
   (UAs), and calls to voicemail servers.  Although SIP implicitly
   provides the redirect/retarget capabilities that enable calls to be
   routed to chosen applications, there is currently no standard
   mechanism within SIP for communicating the history of such a request.
   This "request history" information allows the receiving application
   to determine hints about how and why the call arrived at the
   application/user.

   This document defines a SIP header, History-Info, to provide a
   standard mechanism for capturing the request history information to
   enable a wide variety of services for networks and end-users.  The
   History-Info header provides a building block for development of new
   services.

1.2.  Conventions and Terminology

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [RFC2119].

   The term "retarget" is used in this document to refer to the process
   of a Proxy Server/User Agent Client (UAC) changing a Uniform Resource
   Identifier (URI) in a request based on the rules for for determining
   request targets as described in Section 16.5 of [RFC3261] and the
   subsequent forwarding of that request as described in section 16.6 of
   [RFC3261].

   The term "forward" is used consistent with the terminology in
   [RFC3261].  Noting that [RFC3261] uses the term "forwarding" to
   describe a proxy's handling of requests for domains for which is not
   responsible, as well as to describe the basic "forwarding" of a
   request (in section 16.6) once a target has been determined.
   However, the context of the usage is sufficient to differentiate the
   slightly different meanings.

   The terms "location service" and "redirect" are used consistent with
   the terminology in [RFC3261].




Barnes & Audet          Expires December 13, 2009               [Page 4]

Internet-Draft                History-Info                     June 2009


1.3.  Background: Why define a Generic Request History Header?

   SIP implicitly provides retargeting capabilities that enable calls to
   be routed to specific applications as defined in [RFC3261].  The
   motivation for capturing the request history is that in the process
   of retargeting a request, old routing information can be forever
   lost.  This lost information may be important history that allows
   elements to which the call is retargeted to process the call in a
   locally defined, application-specific manner.  This document defines
   a mechanism for transporting the request history.  It does not define
   any application-specific behavior for a Proxy or UA upon receipt of
   the information.  Indeed, such behavior should be a local decision
   for the recipient application.

   Current network applications provide the ability for elements
   involved with the call to exchange additional information relating to
   how and why the call was routed to a particular destination.  The
   following are examples of such applications:

   1.  Web "referral" applications, whereby an application residing
       within a web server determines that a visitor to a website has
       arrived at the site via an "associate" site that will receive
       some "referral" commission for generating this traffic

   2.  Email forwarding whereby the forwarded-to user obtains a
       "history" of who sent the email to whom and at what time

   3.  Traditional telephony services such as voicemail, call-center
       "automatic call distribution", and "follow-me" style services

   Several of the aforementioned applications currently define
   application-specific mechanisms through which it is possible to
   obtain the necessary history information.

   In addition, request history information could be used to enhance
   basic SIP functionality by providing the following:

   o  Some diagnostic information for debugging SIP requests.  (Note
      that the diagnostic utility of this mechanism is limited by the
      fact that its use by entities that retarget is optional.)

   o  Capturing aliases and Globally Routable User Agent URIs (GRUUs)
      [I-D.ietf-sip-gruu], which can be overwritten by a home proxy upon
      receipt of the initial request.

   o  Facilitating the use of limited use addresses (minted on demand)
      and sub-addressing.




Barnes & Audet          Expires December 13, 2009               [Page 5]

Internet-Draft                History-Info                     June 2009


   o  Preserving service specific URIs that can be overwritten by a
      downstream proxy, such as those defined in [RFC3087], and control
      of network announcements and IVR with SIP URI [RFC4240].

   o  A stronger security solution for SIP.  A side effect is that each
      proxy that captures the "request history" information in a secure
      manner provides an additional means (without requiring signed
      keys) for the original requestor to be assured that the request
      was properly retargeted.


2.  Request History Requirements

   The following list constitutes a set of requirements for a "Request
   History" capability.

   1.  CAPABILITY-req: The "Request History" capability provides a
       capability to inform proxies and UAs involved in processing a
       request about the history/progress of that request.  Although
       this is inherently provided when the retarget is in response to a
       SIP redirect, it is deemed useful for non-redirect retargeting
       scenarios, as well.

   2.  GENERATION-req: "Request History" information is generated when
       the request is retargeted.

       A.  In some scenarios, it might be possible for more than one
           instance of retargeting to occur within the same Proxy.  A
           proxy should also generate Request History information for
           the 'internal retargeting'.

       B.  An entity (UA or proxy) retargeting in response to a redirect
           or REFER should include any Request History information from
           the redirect/REFER in the new request.

   3.  ISSUER-req: "Request History" information can be generated by a
       UA or proxy.  It can be passed in both requests and responses.

   4.  CONTENT-req: The "Request History" information for each
       occurrence of retargeting shall include the following:

       A.  The new URI or address to which the request is in the process
           of being retargeted,

       B.  The URI or address from which the request was retargeted,

       C.  The mechanism by which the new URI or address was determined,




Barnes & Audet          Expires December 13, 2009               [Page 6]

Internet-Draft                History-Info                     June 2009


       D.  The reason for the Request-URI or address modification,

       E.  Chronological ordering of the Request History information.

   5.  REQUEST-VALIDITY-req: Request History is applicable to requests
       not sent within an established dialog (e.g., INVITE, REGISTER,
       MESSAGE, and OPTIONS).

   6.  BACKWARDS-req: Request History information may be passed from the
       generating entity backwards towards the UAC.  This is needed to
       enable services that inform the calling party about the dialog
       establishment attempts.

   7.  FORWARDS-req: Request History information may also be included by
       the generating entity in the request, if it is forwarded onwards.

2.1.  Security Requirements

   The Request History information is being inserted by a network
   element retargeting a Request, resulting in a slightly different
   problem than the basic SIP header problem, thus requiring specific
   consideration.  It is recognized that these security requirements can
   be generalized to a basic requirement of being able to secure
   information that is inserted by proxies.

   The potential security problems include the following:

   1.  A rogue application could insert a bogus Request History entry
       either by adding an additional entry as a result of retargeting
       or entering invalid information.

   2.  A rogue application could re-arrange the Request History
       information to change the nature of the end application or to
       mislead the receiver of the information.

   3.  A rogue application could delete some or all of the Request
       History information.

   Thus, a security solution for "Request History" must meet the
   following requirements:

   1.  SEC-req-1: The entity receiving the Request History must be able
       to determine whether any of the previously added Request History
       content has been altered.

   2.  SEC-req-2: The ordering of the Request History information must
       be preserved at each instance of retargeting.




Barnes & Audet          Expires December 13, 2009               [Page 7]

Internet-Draft                History-Info                     June 2009


   3.  SEC-req-3: The entity receiving the information conveyed by the
       Request History must be able to authenticate the entity providing
       the request.

   4.  SEC-req-4: To ensure the confidentiality of the Request History
       information, only entities that process the request should have
       visibility to the information.

   It should be noted that these security requirements apply to any
   entity making use of the Request History information, either by
   retargeting and capturing the information, or as an application
   making use of the information received in either a Request or
   Response.

2.2.  Privacy Requirements

   Since the Request-URI that is captured could inadvertently reveal
   information about the originator, there are general privacy
   requirements that MUST be met:

   1.  PRIV-req-1: The entity retargeting the Request must ensure that
       it maintains the network-provided privacy (as described in
       [RFC3323]) associated with the Request as it is retargeted.

   2.  PRIV-req-2: The entity receiving the Request History must
       maintain the privacy associated with the information.  In
       addition, local policy at a proxy may identify privacy
       requirements associated with the Request-URI being captured in
       the Request History information.

   3.  PRIV-req-3: Request History information subject to privacy shall
       not be included in ougoing messages unless it is protected as
       described in [RFC3323].


3.  Request History Information Description

   The fundamental functionality provided by the request history
   information is the ability to inform proxies and UAs involved in
   processing a request about the history or progress of that request
   (CAPABILITY-req).  The solution is to capture the Request-URIs as a
   request is forwarded in a new header for SIP messages: History-Info
   (CONTENT-req).  This allows for the capturing of the history of a
   request that would be lost with the normal SIP processing involved in
   the subsequent forwarding of the request.  This solution proposes no
   changes in the fundamental determination of request targets or in the
   request forwarding as defined in Sections 16.5 and 16.6 of the SIP
   protocol specification [RFC3261].



Barnes & Audet          Expires December 13, 2009               [Page 8]

Internet-Draft                History-Info                     June 2009


   The History-Info header can appear in any request not associated with
   an established dialog (e.g., INVITE, REGISTER, MESSAGE, REFER and
   OPTIONS, PUBLISH and SUBSCRIBE, etc.)  (REQUEST-VALIDITY-req) and any
   valid response to these requests (ISSUER-req).

   The History-Info header is added to a Request when a new request is
   created by a UAC or forwarded by a Proxy, or when the target of a
   request is changed.  The term "retarget" refers to this changing of
   the target of a request and the subsequent forwarding of that
   request.  In terms of the SIP protocol, the processing associated
   with retargeting is described in Sections 16.5 and 16.6 of [RFC3261].
   As described in Section 16.5 of [RFC3261], it is possible for the
   target of a request to be changed by the same proxy multiple times
   (referred to as 'internal retargeting' in Section 2), as the proxy
   MAY add targets to the target set after beginning Request Forwarding.
   Section 16.6 of [RFC3261] describes Request Forwarding.  It is during
   this process of Request Forwarding that the History Information is
   captured as an optional, additional header field.  Thus, the addition
   of the History-Info header does not impact fundamental SIP Request
   Forwarding.  An entity (UA or proxy) changing the target of a request
   in response to a redirect or REFER SHOULD also propagate any History-
   Info header from the initial Request in the new request (GENERATION-
   req, FORWARDS-req).

3.1.  Optionality of History-Info

   The History-Info header is optional in that neither UAs nor Proxies
   are required to support it.  A new Supported header, "histinfo", is
   included in the Request sent by a UAC to indicate whether the
   History-Info header should be returned in Responses (BACKWARDS-req).
   In addition to the "histinfo" Supported header, local policy and
   privacy considerations determine whether or not the header is added
   to any Request, or for a specific Request-URI, being retargeted.
   Privacy considerations are described in Section 3.2.

3.2.  Ensuring the Privacy of History-Info

   Since the History-Info header can inadvertently reveal information
   about the requestor as described in [RFC3323], the Privacy header
   SHOULD be used to determine whether an intermediary can include the
   History-Info header in a Request that it receives (PRIV-req-2) or
   that it retargets (PRIV-req-1).  Thus, the History- Info header
   SHOULD NOT be included in Requests where the requestor has indicated
   a priv-value of Session- or Header-level privacy.

   In addition, the History-Info header can reveal general routing
   information, which may be viewed by a specific intermediary or
   network, to be subject to privacy restrictions.  Thus, local policy



Barnes & Audet          Expires December 13, 2009               [Page 9]

Internet-Draft                History-Info                     June 2009


   MAY also be used to determine whether to include the History-Info
   header at all, whether to capture a specific Request-URI in the
   header as is, whether it be included only in the Request as it is
   retargeted within a specific domain, or whether it is anonymized when
   being retargeted outside a specific domain (PRIV-req-3).  The latter
   two cases can be accomplished with a new priv-value, history, added
   to the Privacy header [RFC3323].  The details as to the use of the
   new priv-value with the Privacy header are provided in section
   Section 4.

   It is recognized that satisfying the privacy requirements can impact
   the functionality of this solution by overriding the request to
   generate the information.  As with the optionality and security
   requirements, applications making use of History-Info SHOULD address
   any impact this may have or MUST explain why it does not impact the
   application.


4.  Request History Information Protocol Details

   This section contains the details and usage of the proposed new SIP
   protocol elements.  It also discusses the security aspects of the
   solution.

4.1.  Protocol Structure of History-Info

   History-Info is a header field as defined by [RFC3261].  It is an
   optional header field and MAY appear in any request or response not
   associated with a dialog or which starts a dialog.  For example,
   History-Info MAY appear in INVITE, REGISTER, MESSAGE, REFER, OPTIONS,
   SUBSCRIBE, and PUBLISH and any valid responses, plus NOTIFY requests
   that initiate a dialog.

   The History-Info header carries the following information, with the
   mandatory parameters required when the header is included in a
   request or response:

   o  Targeted-to-URI (hi-targeted-to-uri): A mandatory parameter for
      capturing the Request-URI for the specific Request as it is
      forwarded.

   o  Index (hi-index): A mandatory parameter for History-Info
      reflecting the chronological order of the information, indexed to
      also reflect the forking and nesting of requests.  The format for
      this parameter is a string of digits, separated by dots to
      indicate the number of forward hops and retargets.  This results
      in a tree representation of the history of the request, with the
      lowest-level index reflecting a branch of the tree.  By adding the



Barnes & Audet          Expires December 13, 2009              [Page 10]

Internet-Draft                History-Info                     June 2009


      new entries in order (i.e., following existing entries per the
      details in Section 4.3.3.1), including the index and securing the
      header, the ordering of the History-Info headers in the request is
      assured (SEC-req-2).  In addition, applications may extract a
      variety of metrics (total number of retargets, total number of
      retargets from a specific branch, etc.) based upon the index
      values.

   o  Reason: An optional parameter for History-Info, reflected in the
      History-Info header by including the Reason Header [RFC3326]
      escaped in the hi-targeted-to-uri.  A reason is not included for a
      hi-targeted-to-uri when it is first added in a History-Info
      header, but rather is added when the retargeting actually occurs
      in the same situations in which the hi-target parameter is added.

   o  Privacy: An optional parameter for History-Info, reflected in the
      History-Info header field values by including the Privacy Header
      [RFC3323] with a priv-value of "history" escaped in the hi-
      targeted-to-uri or by adding the Privacy header with a priv-value
      of "history" to the Request.  The latter case indicates that the
      History-Info headers SHOULD be anonymized prior to forwarding or
      they SHOULD NOT be forwarded, whereas the use of the Privacy
      header escaped in the hi-targeted-to-uri means that a specific hi-
      entry SHOULD be anonymized or it SHOULD NOT be forwarded.  It is
      RECOMMENDED that the entries be anonymized, rather than not
      forwarded, to minimize the impact on applications making use of
      the History-Info header.

   o  Target (hi-target): A mandatory parameter for the History-Info
      indicating the mechanism by which the new target is determined,
      based on the procedures of 16.5 [RFC3261].  Note that hi-target is
      not added for a hi-entry when it is first added in a History-Info
      header field, but rather is added when the retargeting actually
      occurs - i.e., the parameter indicates that the specific hi-
      targeted-to-uri was retargeted and thus the previous information
      in the request-URI may be "lost".  Upon receipt of a request or
      response containing the History-Info header, a UA can determine a
      "lost" target for a request by traversing the HI entries in
      reverse order to find the first one tagged with a specific hi-
      target parameter.  The following values are defined for this
      parameter:

      *  "noop": There is no change whatsoever in the target.  The
         Request-URI is unchanged.  This would apply for example when a
         proxy merely forwards a request to a next hop proxy and loose
         routing is used.





Barnes & Audet          Expires December 13, 2009              [Page 11]

Internet-Draft                History-Info                     June 2009


      *  "predetermined": This is the case where retargeting is
         predetermined by the content of the request itself, i.e., the
         Request-URI contained a maddr, the domain of the Request-URI
         indicates a domain the proxy is not responsible for, or strict
         routing is used and the request is forwarded to another proxy.

      *  "reg-uri": The Request-URI is replaced with a registered
         Contact bound to the AOR indicated by the Request-URI.  For
         example, if the REGISTER message had a To header field with the
         AOR <sip:bob@example.com>, and a Contact header field of
         <sip:bob@192.168.0.3> , the Request-URI <sip:bob@example.com>
         would be changed to <sip:bob@192.168.0.3>.

      *  "reg-uri-alias": The Request-URI is replaced with a registered
         Contact bound to an AOR that is an alias of the Request-URI.
         An AOR is an Alias of another AOR if both entities belong to
         the same implicit registration set, are linked to the same
         profile and have the same data configured.  For example, if
         <sip:+14085551212@example.com;user=phone> and
         <sip:bob.smith@example.com> are configured as aliases for the
         AOR sip:bob@example.com> (where the registered Contact of
         <sip:bob@192.168.0.3> is bound to <sip:bob@example.com>, a
         Request-URI of <sip:bob.smith@example.com> or
         <sip:+14085551212@example.com;user=phone> would be changed to
         <sip:bob@192.168.0.3>.

      *  "mapped": The Request-URI is replaced with another URI that is
         not a Contact associated with the AOR in the Request-URI or one
         of its aliases.  For example, this would apply when the request
         is retargeted to a different user.

      *

            OPEN ISSUE: The values for hi-target are tentative and are
            still behing debated.  They will be changed to reflect the
            consensus so that it is meaningful to the applications such
            as those described in
            [I-D.rosenberg-sip-target-uri-delivery] and is unambigous
            with regards to SIP terminology in [RFC3261].  For example,
            it has been suggested that "noop" and "predetermined" be
            combined into a single value.

   o  Extension (hi-extension): An optional parameter to allow for
      future optional extensions.  As per [RFC3261], any implementation
      not understanding an extension should ignore it.

   The following summarizes the syntax of the History-Info header, based
   upon the standard SIP syntax [RFC3261]:



Barnes & Audet          Expires December 13, 2009              [Page 12]

Internet-Draft                History-Info                     June 2009


   History-Info = "History-Info" HCOLON hi-entry *(COMMA hi-entry)

   hi-entry = hi-targeted-to-uri SEMI hi-index *(SEMI hi-target)
              *( SEMI hi-extension )

   hi-targeted-to-uri = name-addr

   hi-index = "index" EQUAL 1*DIGIT *("." 1*DIGIT)

   hi-target = "noop" / "predetermined" / "reg-uri"
               / "reg-uri-alias" / "mapped"

   hi-extension = generic-param


4.2.  Protocol Examples

   The following provides some examples of the History-Info header.
   Note that the backslash and CRLF between the fields in the examples
   below are for readability purposes only.

   History-Info: <sip:UserA@ims.example.com>;index=1;foo=bar

   History-Info: <sip:UserA@ims.example.com?Reason=SIP%3B\
                 cause%3D302>;index=1.1;mapped,\
                 <sip:UserB@example.com?Privacy=history&Reason=SIP%3B\
                 cause%3D486>;index=1.2;mapped,\
                 <sip:45432@192.168.0.3>;index=1.3;reg-uri

4.3.  Protocol Usage

   This section describes the processing specific to UAs and Proxies for
   the History-Info header, the "histinfo" option tag, and the priv-
   value of "history".  As discussed in Section 1.3, the fundamental
   objective is to capture the target Request-URIs as a request is
   forwarded.  This allows for the capturing of the history of a request
   that would be lost due to subsequent (re)targeting and forwarding.
   To accomplish this for the entire history of a request, either the
   UAC must capture the Request-URI in a History-Info header in the
   initial request or a proxy must add a History-Info header with both a
   hi-entry for the Request-URI in the initial request and a hi-entry
   for the target Request-URI as the request is forwarded.  The basic
   processing is for each entity forwarding a request to add a hi-entry
   for the target Request-URI, updating the index and adding the Reason
   and Target parameters as appropriate for any retargeted Request-URIs.






Barnes & Audet          Expires December 13, 2009              [Page 13]

Internet-Draft                History-Info                     June 2009


4.3.1.  User Agent Client (UAC) Behavior

   The UAC SHOULD include the "histinfo" option tag in the Supported
   header in any request not associated with an established dialog for
   which the UAC would like the History-Info header in the response.  In
   addition, the UAC MAY add a History-Info header, using the Request-
   URI of the request as the hi-target-to-uri, in which case the index
   MUST be set to a value of 1 in the hi-entry.  As a result,
   intermediaries and the UAS will know at least the original Request-
   URI, and if the Request-URI was modified by a previous hop.
   Normally, UACs are not expected to include a History-Info header in
   an initial request as it is more of a Proxy function; the reason it
   is allowed is for B2BUAs who are performing proxy-like functions like
   routing.

   In the case where a UAC receives a 3xx response with a Contact
   header, the UAC SHOULD maintain the previous hi-entry(s) in the
   request.  The reason header MUST be associated with the hi-targeted-
   to-uri in the previous (last) hi-entry, as described in
   Section 4.3.3.1.2.  The previous (last) hi-entry in the response
   SHOULD have a a hi-target parameter which had been added by the
   entity that returned the 3xx response, if the entity has implemented
   this specification.  If there is no hi-target parameter in the
   previous hi-entry, the UAC MUST NOT add an hi-target parameter to the
   hi-entry.  In either case, a new hi-entry MUST then be added for the
   URI from the Contact header (which becomes the new Request-URI).  In
   this case, the index is created by reading and incrementing the value
   of the index from the previous hi-entry, thus following the same
   rules as those prescribed for a proxy in retargeting, described in
   Section 4.3.3.1.3.

   A UAC that does not want the History-Info header added due to privacy
   considerations MUST include a Privacy header with a priv-value(s) of
   "session", "header", or "history" in the request.

   With the exception of the processing of a 3xx response described
   above, the processing of the History-Info header received in the
   Response is application specific and outside the scope of this
   document.  However, the validity of the information SHOULD be ensured
   prior to any application usage.  For example, the entries can be
   evaluated to determine gaps in indices, which could indicate that an
   entry has been maliciously removed or removed for privacy reasons.
   Either way, an application may want to be aware of potentially
   missing information.







Barnes & Audet          Expires December 13, 2009              [Page 14]

Internet-Draft                History-Info                     June 2009


4.3.2.  User Agent Server (UAS) Behavior

   The processing of the information in the History-Info header by a UAS
   in a Request depends upon local policy and specific applications at
   the UAS that might make use of the information.  Prior to any
   application usage of the information, the validity SHOULD be
   ascertained.  For example, the entries MAY be evaluated to determine
   gaps in indices, which could indicate that an entry has been
   maliciously removed or removed for privacy reasons.  Either way, an
   application MAY want to be aware of potentially missing information.

   If the "histinfo" option tag is received in a request, the UAS MUST
   include any History-Info received in the request in the subsequent
   response.

4.3.3.  Proxy Behavior

4.3.3.1.  Adding the History-Info Header to Requests

   A proxy conforming to this specification MUST add a hi-entry as it
   forwards a Request.  Section 16.6 of [RFC3261] defines the steps to
   be followed as the proxy forwards a Request.  Step 5 prescribes the
   addition of optional headers.  Although this would seem the
   appropriate step for adding the History-Info header, the interaction
   with Step 6, "Postprocess routing information", and the impact of a
   strict route in the Route header could result in the Request-URI
   being changed; thus, adding the History-Info header between Steps 8
   (adding Via header) and 9 (adding Content-Length) is RECOMMENDED.
   Note that in the case of loose routing, the Request-URI does not
   change during the forwarding of a Request; thus, the capturing of
   History-Info for such a request results in duplicate Request-URIs
   with different indices with hi-target set to "noop."  The hi-entry
   MUST be added following any hi-entry received in the request being
   forwarded.  Additionally, if a request is received that doesn't
   include a History-Info header, the proxy MAY add a History-Info
   header with a hi-entry preceding the one being added for the current
   request being forwarded.  The index for this hi-entry MUST start at
   1.  The following subsections define the details of creating the
   information associated with each hi-entry.

4.3.3.1.1.  Privacy in the History-Info Header

   If there is a Privacy header in the request with a priv-value of
   "session", "header", or "history", an hi-entry SHOULD be added if the
   request is being forwarded to a Request-URI associated with a domain
   for which the processing entity is responsible.  If there is no
   Privacy header, but the proxy's local policies indicate that the hi-
   entry(s) cannot be forwarded beyond the domain for which this



Barnes & Audet          Expires December 13, 2009              [Page 15]

Internet-Draft                History-Info                     June 2009


   intermediary is responsible, then a Privacy header with a priv-value
   of "history" SHOULD be associated with each hi-entry added by the
   proxy as the request is forwarded within the domain.

   If a request is being forwarded to a Request-URI associated with a
   domain for which the proxy is not responsible and there is a Privacy
   header in the request with a priv-value of "session", "header", or
   "history", the proxy SHOULD anonymize hi-entry(s) as per [RFC3323]
   prior to forwarding, unless the proxy knows a priori that it can rely
   on a downstream proxy to apply the requested privacy or local policy
   allows the forwarding.  If the proxy is not able to anonymize the hi-
   entry(s) as RECOMMENDED, then the proxy SHOULD remove any hi-entry(s)
   that it has added.

4.3.3.1.2.  Reason in the History-Info Header

   For retargets that are the result of an explicit SIP response, a
   Reason MUST be associated with the hi-targeted-to-uri.  If the SIP
   response does not include a Reason header, the SIP Response Code that
   triggered the retargeting MUST be included as the Reason associated
   with the hi-targeted-to-uri that has been retargeted.  If the
   response contains a non-SIP Reason header (e.g., Q.850), it MUST be
   captured as an additional Reason associated with the hi-targeted-to-
   uri that has been retargeted, along with the SIP Response Code.  If
   the Reason header is a SIP reason, then it MUST be used as the Reason
   associated with the hi-targeted-to-uri rather than the SIP response
   code.

   For retargets as a result of timeouts or internal events, a Reason
   MAY be associated with the hi-targeted-to-uri that has been
   retargeted.

   The addition of the Reason should occur prior to the forwarding of
   the request (which may add a new hi-entry with a new hi-targeted-to-
   uri) as it is associated with the hi-targeted-to-uri that has been
   retargeted, since it reflects the reason why the Request to that
   specific URI was not successful.

4.3.3.1.3.  Indexing in the History-Info Header

   In order to maintain ordering and accurately reflect the nesting and
   retargeting of the request, an index MUST be included along with the
   Targeted-to-URI being captured.  Per the syntax in Section 4.1, the
   index consists of a dot-delimited series of digits (e.g., 1.1.2).
   Each dot reflects a hop or level of nesting; thus, the number of hops
   is determined by the total number of dots.  Within each level, the
   integer reflects the number of peer entities to which the request has
   been routed.  Thus, the indexing results in a logical tree



Barnes & Audet          Expires December 13, 2009              [Page 16]

Internet-Draft                History-Info                     June 2009


   representation for the history of the Request.  For each level of
   indexing, the index MUST start at 1.  An increment of 1 MUST be used
   for advancing to a new branch.

   The basic rules for adding the index are summarized as follows:

   1.  Basic Forwarding: In the case of a Request that is being
       forwarded, the index is determined by adding another level of
       indexing since the depth/length of the branch is increasing.  To
       accomplish this, the proxy reads the value from the History-Info
       header in the received request, if available, and adds another
       level of indexing by appending the dot delimiter followed by an
       initial index for the new level of 1.  For example, if the index
       in the last History-Info header field in the received request is
       1.1, this proxy would initialize its index to 1.1.1 and forward
       the request.

   2.  Retargeting within a Proxy - 1st instance: For the first instance
       of retargeting within a Proxy, the calculation of the index
       follows that prescribed for basic forwarding.

   3.  Retargeting within a Proxy - subsequent instance: For each
       subsequent retargeting of a request by the same proxy, another
       branch is added.  With the index for each new branch calculated
       by incrementing the last/lowest digit at the current level, the
       index in the next request forwarded by this same proxy, following
       the example above, would be 1.1.2.

   4.  Retargeting based upon a Response: In the case of retargeting due
       to a specific response (e.g., 302), the index would be calculated
       per rule 3.  That is, the lowest/last digit of the index is
       incremented (i.e., a new branch is created), with the increment
       of 1.  For example, if the index in the History-Info header of
       the received request was 1.2, then the index in the History-Info
       header field for the new hi-targeted- to-URI would be 1.3.

   5.  Retargeting the request in parallel (forking): If the request
       forwarding is done in parallel, the index MUST be captured for
       each forked request per the rules above, with each new Request
       having a unique index.  The only difference in the messaging for
       this scenario and the messaging produced per basic proxy
       retargeting in rules 2 and 3 is these forwarded requests do not
       have History-Info entries associated with their peers.  The proxy
       builds the subsequent response (or request) using the aggregated
       information associated with each of those requests and including
       the header entries in the order indicated by the indexing.
       Responses are processed as described in Section 16.7 of [RFC3261]
       with the aggregated History-Info entries processed similar to



Barnes & Audet          Expires December 13, 2009              [Page 17]

Internet-Draft                History-Info                     June 2009


       Step 7 "Aggregate Authentication Header Field Values".

4.3.3.1.4.  Request Target in the History-Info Header

   An hi-target attribute MUST be included in a request forwarded by a
   proxy.  The addition of the hi-target parameter MUST occur prior to
   the forwarding of the request (which may add a new hi-entry with a
   new hi-targeted-to- uri) as it is associated with the hi-targeted-to-
   uri that has been retargeted.

   If the incoming request already contains a History-Info header field,
   and the hi-targeted-to-uri in the last hi-entry is identical to the
   Request-URI of the received request, the proxy MUST add a hi-target
   attribute with value "noop" to that hi-entry.  In the case that the
   request did not contain a History-Info header, or if the last hi-
   entry is not identical to the Request-URI of the received request,
   the proxy MUST add another History-Info header field value as
   described in Section 4.3.3.1 and MUST add a hi-target attribute to
   this hi-entry.

   If the Request-URI itself predetermined the routing as per the
   procedures of 16.5/[RFC3261], i.e., if there was a maddr parameter,
   or if the domain indicates a domain that the proxy is not responsible
   for, or strict routing is used and the request is forwarded to
   another proxy, the hi-target attribute MUST be set to
   "predetermined."

   If the Request-URI is being replaced with a registered Contact
   header, bound to the AOR indicated by the Request-URI, the hi-target
   attribute MUST be set to "reg-uri."

   If the Request-URI is replaced with a registered Contact bound to an
   AOR that is an alias of the Request-URI, the hi-target attribute MUST
   be set to "reg-uri-alias."

   If the request is being forwarded based on the receipt of a 3xx
   response with a Contact header and the previous (last) hi-entry
   already has an hi-target parameter, then another hi-target attribute
   MUST not be added to the hi-entry.  This would occur in the case of a
   redirect server that has implemented this specification.

   In all other cases, the Request-URI is replaced with another URI that
   is not a Contact associated with the AOR in the Request-URI or one of
   its aliases.  In this case, the hi-target attribute MUST be set to
   "mapped."

   The index is set as defined in Section 4.3.3.1.3.




Barnes & Audet          Expires December 13, 2009              [Page 18]

Internet-Draft                History-Info                     June 2009


   Once the proxy has translated the Request-URI into a contact URI
   based on a location service lookup, it MUST add an additional hi-
   entry containing the Contact URI for each request to be forwarded as
   described in Section 4.3.3.1.  The hi-target attribute MUST NOT be
   added to this hi-entry.

4.3.3.2.  Sending History-Info in Responses

   A proxy that receives a Request with the "histinfo" option tag in the
   Supported header, and depending upon a local policy supporting the
   capture of History-Info, SHOULD return captured History-Info in
   subsequent, provisional, and final responses to the Request, subject
   to the following considerations for privacy:

   o  If the response is being forwarded to a Request-URI associated
      with a domain for which the proxy is not responsible and there was
      a Privacy header, in the request received by the proxy, with a
      priv-value of "session", "header", or "history", the proxy SHOULD
      anonymize the History-Info header (i.e., all hi-entries) prior to
      forwarding.  If the proxy is not able to anonymize the hi-entry(s)
      as RECOMMENDED, then the proxy SHOULD remove the History-Info
      header.

   o  If a response is being forwarded to a Request-URI associated with
      a domain for which the proxy is not responsible and local policy
      requires privacy associated with any or all hi-entry(s) it has
      added, any hi-entry with a priv-value of "history" SHOULD be
      anonymized prior to forwarding.  If the proxy is not able to
      anonymize the hi-entry as RECOMMENDED, then the proxy SHOULD
      remove the hi-entry.

   o  If a proxy receives a response from another intermediary
      associated with a domain for which it is responsible, including
      hi-entry(s) with privacy headers, and that response is to be
      forwarded to a domain for which it is not responsible, then those
      hi-entry(s) SHOULD be anonymized.  If the proxy is not able to
      anonymize the hi-entry(s) as RECOMMENDED, then the proxy SHOULD
      remove the hi-entry(s).

   The processing of History-Info in responses follows the methodology
   described in Section 16.7 of [RFC3261], with the processing of
   History-Info headers adding an additional step, just before Step 9,
   "Forwarding the Response".

4.3.4.  Redirect Server Behavior

   A redirect server MUST include the History-Info headers received in
   the request in the 3XX response.  The redirect server MUST also add



Barnes & Audet          Expires December 13, 2009              [Page 19]

Internet-Draft                History-Info                     June 2009


   the appropriate hi-target attribute to the last hi-entry received in
   the request to the last hi-entry in the response per the rules
   defined in Section 4.3.3.1.4.

4.4.  Example Call Flows with History-Info Header

   This section contains some basic call examples using the History-Info
   header, including the use of privacy and the hi-target attribute.
   All the examples in this section are using loose routing procedures.
   If strict routing procedures were used, instead of entries with hi-
   target set to "noop", there would be entries with hi-target set to
   "predetermined" instead.

   The formatting in these scenarios is for visual purposes; thus,
   backslash and CRLF are used between the fields for readability and
   the headers in the URI are not shown properly formatted for escaping.
   Refer to Section 4.2 for the proper formatting.  Additional detailed
   scenarios are available in the Appendix A.

4.4.1.  Basic Call with History-Info

   In this example, Alice (sip:alice@atlanta.example.com) calls Bob
   (sip:bob@biloxi.example.com).  Alice's home proxy (sip:
   atlanta.example.com) forwards the request to Bob's proxy (sip:
   biloxi.example.com).  When the request arrives at sip:
   biloxi.example.com, it does a location service lookup for
   bob@biloxi.example.com and changes the target of the request to Bob's
   Contact URI provided as part of normal SIP registration.

   One important thing illustrated by this call flow is that without
   History-Info, Bob would "lose" the target information, including any
   parameters in the request URI.  Bob can now recover that information
   by looking for the last hi-entry marked as "reg-uri" or "reg-uri-
   alias" hi-target.

















Barnes & Audet          Expires December 13, 2009              [Page 20]

Internet-Draft                History-Info                     June 2009


   Alice   atlanta.example.com  biloxi.example.com   Bob
   |                |                |                |
   |   INVITE sip:bob@biloxi.example.com;p=x          |
   |--------------->|                |                |
   | Supported: histinfo             |                |
   |                |                |                |
   |                |   INVITE sip:bob@biloxi.example.com;p=x
   |                |--------------->|                |
   | History-Info: <sip:bob@biloxi.example.com;p=x>;index=1;noop
   | History-Info: <sip:bob@biloxi.example.com;p=x>;index=1.1
   |                |                |                |
   |                |                |   INVITE sip:bob@192.0.2.3
   |                |                |--------------->|
   | History-Info: <sip:bob@biloxi.example.com;p=x>;index=1;noop
   | History-Info: <sip:bob@biloxi.example.com;p=x>;index=1.1;reg-uri
   | History-Info: <sip:bob@192.0.2.3>;index=1.1.1
   |                |                |                |
   |                |                |     200        |
   |                |                |<---------------|
   | History-Info: <sip:bob@biloxi.example.com;p=x>;index=1;noop
   | History-Info: <sip:bob@biloxi.example.com;p=x>;index=1.1;reg-uri
   | History-Info: <sip:bob@192.0.2.3>;index=1.1.1
   |                |                |                |
   |                |     200        |                |
   |                |<---------------|                |
   | History-Info: <sip:bob@biloxi.example.com;p=x>;index=1;noop
   | History-Info: <sip:bob@biloxi.example.com;p=x>;index=1.1;reg-uri
   | History-Info: <sip:bob@192.0.2.3>;index=1.1.1
   |                |                |                |
   |     200        |                |                |
   |<---------------|                |                |
   | History-Info: <sip:bob@biloxi.example.com;p=x>;index=1;noop
   | History-Info: <sip:bob@biloxi.example.com;p=x>;index=1.1;reg-uri
   | History-Info: <sip:bob@192.0.2.3;index=1.1.1
   |                |                |                |
   |     ACK        |                |                |
   |--------------->|    ACK         |                |
   |                |--------------->|     ACK        |
   |                |                |--------------->|

                           Figure 1: Basic Call

4.4.2.  History-Info with Privacy Header

   The next example provides the basic call scenario Section 4.4.1 using
   one of the privacy mechanisms, with sip:biloxi.example.com adding the
   Privacy header indicating that the History-Info header information is
   anonymized outside the biloxi.example.com domain.  This scenario



Barnes & Audet          Expires December 13, 2009              [Page 21]

Internet-Draft                History-Info                     June 2009


   highlights the potential functionality lost with the use of "history"
   privacy in the Privacy header for the entire request and the need for
   careful consideration on the use of privacy for History-Info.

   Alice   atlanta.example.com  biloxi.example.com   Bob
   |                |                |                |
   |   INVITE sip:bob@biloxi.example.com;p=x          |
   |--------------->|                |                |
   | Supported: histinfo             |                |
   |                |                |                |
   |                |   INVITE sip:bob@biloxi.example.com;p=x
   |                |--------------->|                |
   | History-Info: <sip:bob@biloxi.example.com;p=x>;index=1;noop
   | History-Info: <sip:bob@biloxi.example.com;p=x>;index=1.1
   |                |                |                |
   |                |                | INVITE sip:bob@192.0.2.3
   |                |                |--------------->|
   | History-Info: <sip:bob@biloxi.example.com;p=x>;index=1;noop
   | History-Info: <sip:bob@biloxi.example.com;p=x>;index=1.1;reg-uri
   | History-Info: <sip:bob@192.0.2.3>;index=1.1.1
   |                |                |                |
   |                |                |     200        |
   |                |                |<---------------|
   | History-Info: <sip:bob@biloxi.example.com;p=x>;index=1;noop
   | History-Info: <sip:bob@biloxi.example.com;p=x>;index=1.1;reg-uri
   | History-Info: <sip:bob@192.0.2.3>;index=1.1.1
   |                |                |                |
   |                |     200        |                |
   |                |<---------------|                |
   | History-Info: <sip:anonymous@anonymous.invalid>;index=1;noop
   | History-Info: <sip:anonymous@anonymous.invalid>;index=1.1;reg-uri
   | History-Info: <sip:anonymous@anonymous.invalid>;index=1.1.1
   |                |                |                |
   |     200        |                |                |
   |<---------------|                |                |
   | History-Info: <sip:anonymous@anonymous.invalid>;index=1;noop
   | History-Info: <sip:anonymous@anonymous.invalid>;index=1.1;reg-uri
   | History-Info: <sip:anonymous@anonymous.invalid>;index=1.1.1
   |                |                |                |
   |     ACK        |                |                |
   |--------------->|    ACK         |                |
   |                |--------------->|     ACK        |
   |                |                |--------------->|

                   Figure 2: Example with Privacy Header






Barnes & Audet          Expires December 13, 2009              [Page 22]

Internet-Draft                History-Info                     June 2009


4.4.3.  Privacy Header for a Specific History-Info Entry

   This example also provides the basic call scenario Section 4.4.1
   using one of the privacy mechanisms, however, due to local policy at
   sip:biloxi.example.com, only the final hi-entry in the History-Info,
   which is Bob's local URI, contains a priv-value of "history", thus
   providing Alice with some information about the history of the
   request, but anonymizing Bob's local URI.











































Barnes & Audet          Expires December 13, 2009              [Page 23]

Internet-Draft                History-Info                     June 2009


   Alice   atlanta.example.com  biloxi.example.com   Bob
   |                |                |                |
   |   INVITE sip:bob@biloxi.example.com;p=x          |
   |--------------->|                |                |
   | Supported: histinfo             |                |
   |                |                |                |
   |                |   INVITE sip:bob@biloxi.example.com;p=x
   |                |--------------->|                |
   | History-Info: <sip:bob@biloxi.example.com;p=x>;index=1;noop
   | History-Info: <sip:bob@biloxi.example.com;p=x>;index=1.1
   |                |                |                |
   |                |                |   INVITE sip:bob@192.0.2.3
   |                |                |--------------->|
   | History-Info: <sip:bob@biloxi.example.com;p=x>;index=1;noop
   | History-Info: <sip:bob@biloxi.example.com;p=x>;index=1.1;reg-uri
   | History-Info: <sip:bob@192.0.2.3?Privacy=history>;index=1.1.1
   |                |                |                |
   |                |                |     200        |
   |                |                |<---------------|
   | History-Info: <sip:bob@biloxi.example.com;p=x>;index=1;noop
   | History-Info: <sip:bob@biloxi.example.com;p=x>;index=1.1;reg-uri
   | History-Info: <sip:bob@192.0.2.3?Privacy=history>;index=1.1.1
   |                |                |                |
   |                |     200        |                |
   |                |<---------------|                |
   | History-Info: <sip:bob@biloxi.example.com;p=x>;index=1;noop
   | History-Info: <sip:bob@biloxi.example.com;p=x>;index=1.1;reg-uri
   | History-Info: <sip:anonymous@anynymous.invalid>;index=1.1.1
   |                |                |                |
   |     200        |                |                |
   |<---------------|                |                |
   | History-Info: <sip:bob@biloxi.example.com;p=x>;index=1;noop
   | History-Info: <sip:bob@biloxi.example.com;p=x>;index=1.1;reg-uri
   | History-Info: <sip:anonymous@anynymous.invalid>;index=1.1.1
   |                |                |                |
   |     ACK        |                |                |
   |--------------->|    ACK         |                |
   |                |--------------->|     ACK        |
   |                |                |--------------->|


          Figure 3: Example with Privacy Header for Specific URI


5.  Application Considerations

   As seen by the example scenarios in the Appendix A, History-Info
   provides a very flexible building block that can be used by



Barnes & Audet          Expires December 13, 2009              [Page 24]

Internet-Draft                History-Info                     June 2009


   intermediaries and UAs for a variety of services.  As such, any
   services making use of History-Info must be designed with the
   following considerations:

   1.  History-Info is optional; thus, a service MUST define default
       behavior for requests and responses not containing History-Info
       headers.

   2.  History-Info may be impacted by privacy considerations.
       Applications requiring History-Info need to be aware that if
       Header-, Session-, or History-level privacy is requested by a UA
       (or imposed by an intermediary) that History-Info may not be
       available in a request or response.  This would be addressed by
       an application in the same manner as the previous consideration
       by ensuring there is reasonable default behavior should the
       information not be available.

   3.  History-Info may be impacted by local policy.  Each application
       making use of the History-Info header SHOULD address the impacts
       of the local policies on the specific application (e.g., what
       specification of local policy is optimally required for a
       specific application and any potential limitations imposed by
       local policy decisions).  Note that this is related to the
       optionality and privacy considerations identified in 1 and 2
       above, but goes beyond that.  For example, due to the optionality
       and privacy considerations, an entity may receive only partial
       History-Info entries; will this suffice?  Note that this would be
       a limitation for debugging purposes, but might be perfectly
       satisfactory for some models whereby only the information from a
       specific intermediary is required.


6.  Security Considerations

   This document defines a new header for SIP.  The use of the Transport
   Layer Security (TLS) protocol [RFC5246] as a mechanism to ensure the
   overall confidentiality of the History-Info headers (SEC- req-4) is
   strongly RECOMMENDED.  This results in History-Info having at least
   the same level of security as other headers in SIP that are inserted
   by intermediaries.  With TLS, History-Info headers are no less, nor
   no more, secure than other SIP headers, which generally have even
   more impact on the subsequent processing of SIP sessions than the
   History-Info header.

   With the level of security provided by TLS (SEC-req-3), the
   information in the History-Info header can thus be evaluated to
   determine if information has been removed by evaluating the indices
   for gaps (SEC-req-1, SEC-req-2).  It would be up to the application



Barnes & Audet          Expires December 13, 2009              [Page 25]

Internet-Draft                History-Info                     June 2009


   to define whether it can make use of the information in the case of
   missing entries.

   Note that while using the SIPS scheme (as per [I-D.ietf-sip-sips])
   protects History-Info from tampering by arbitrary parties outside the
   SIP message path, all the intermediaries on the path are trusted
   implicitly.  A malicious intermediary could arbitrarily delete,
   rewrite, or modify History-Info.  This specification does not attempt
   to prevent or detect attacks by malicious intermediaries.


7.  IANA Considerations

   This document requires several IANA registrations detailed in the
   following sections.

7.1.  Registration of New SIP History-Info Header

   This document defines a new SIP header field name: History-Info and a
   new option tag: histinfo.  The following changes have been made to
   http:///www.iana.org/assignments/sip-parameters The following row has
   been added to the header field section:

   Header Name             Compact Form               Reference
   -----------             ------------               ---------
   History-Info               none                    [RFCXXXX]


   The following has been added to the Options Tags section:

   Name          Description                          Reference
   ----          -----------                          ---------
   histinfo      When used with the Supported header, [RFCXXXX]
                 this option tag indicates the UAC
                 supports the History Information to be
                 captured for requests and returned in
                 subsequent responses.  This tag is not
                 used in a Proxy-Require or Require
                 header field since support of
                 History-Info is optional.


   Note to RFC Editor: Please replace RFC XXXX with the RFC number of
   this specification.







Barnes & Audet          Expires December 13, 2009              [Page 26]

Internet-Draft                History-Info                     June 2009


7.2.  Registration of "history" for SIP Privacy Header

   This document defines a new priv-value for the SIP Privacy header:
   history The following changes have been made to
   http://www.iana.org/assignments/sip-priv-values The following has
   been added to the registration for the SIP Privacy header:

   Name      Description               Registrant   Reference
   ----      -----------               ----------   ---------
   history   Privacy requested for     Mary Barnes  [RFCXXXX]
             History-Info header(s)    mary.barnes@nortel.com


   Note to RFC Editor: Please replace RFC XXXX with the RFC number of
   this specification.


8.  Contributors

   Cullen Jennings, Mark Watson, and Jon Peterson contributed to the
   development of the initial requirements for [RFC4244].

   Jonathan Rosenberg produced the initial document that provided the
   basis for the addition of the "target" parameter to the History-Info
   header, as well as some content for this document.


9.  Acknowledgements

   The editor would like to acknowledge the constructive feedback
   provided by Robert Sparks, Paul Kyzivat, Scott Orton, John Elwell,
   Nir Chen, Palash Jain, Brian Stucker, Norma Ng, Anthony Brown,
   Jayshree Bharatia, Jonathan Rosenberg, Eric Burger, Martin Dolly,
   Roland Jesske, Takuya Sawada, Sebastien Prouvost, and Sebastien
   Garcin in the development of [RFC4244].  The editor would like to
   acknowledge the significant input from Rohan Mahy on some of the
   normative aspects of the ABNF for [RFC4244], particularly around the
   need for and format of the index and around the security aspects.

   Many thanks to Hans Eric Van Elburg, Christer Holmberg and Shida
   Shubert for the help on this update to [RFC4244], especially
   regarding the requirements for preserving target-URI information all
   the way to the UAS.  Thanks to Ian Elz for his feedback on privacy.


10.  Changes since last Version

   NOTE TO THE RFC-Editor: Please remove this section prior to



Barnes & Audet          Expires December 13, 2009              [Page 27]

Internet-Draft                History-Info                     June 2009


   publication as an RFC.

   Changes from barnes-sipcore-4244bis-00 to 01 :

   1.  Clarified "retarget" definition.

   2.  Removed privacy discussion from optionality section - just refer
       to privacy section.

   3.  Removed extraneous text from target-parameter (leftover from sip-
       4244bis).  Changed the terminology from the "reason" to the
       "mechanism" to avoid ambiguity with parameter.

   4.  Various changes to clarify some of the text around privacy.

   5.  Reverted proxy response handling text to previous form - just
       changing the privacy aspects to anonymize, rather than remove.

   6.  Other editorial changes to condense and simplify.

   Changes from barnes-sip-4244bis-00 to barnes-sipcore-4244bis-00:

   1.   Added tags for each type of retargeting including proxy hops,
        etc. - i.e., a tag is defined for each specific mechanism by
        which the new Request-URI is determined.  Note, this is
        extremely helpful in terms of backwards compatibility.

   2.   Fixed all the examples.  Made sure loose routing was used in all
        of them.

   3.   Removed example where a proxy using strict routing is using
        History-Info for avoiding trying same route twice.

   4.   Remove redundant Redirect Server example.

   5.   Index are now mandated to start at "1" instead of recommended.

   6.   Clarified 3xx behavior as the entity sending the 3XX response
        MUST add the hi-target attribute to the previous hi-entry to
        ensure that it is appropriately tagged (i.e., it's the only one
        that knows how the contact in the 3xx was determined.)

   7.   Removed lots of ambiguity by making many "MAYs" into "SHOULDs"
        and "some "SHOULDs" into "MUSTs".

   8.   Privacy is now recommended to be done by anonymizing entries as
        per RFC 3323 instead of by removing or omitting hi-entry(s).




Barnes & Audet          Expires December 13, 2009              [Page 28]

Internet-Draft                History-Info                     June 2009


   9.   Requirement for TLS is now same level as per RFC 3261.

   10.  Removed "OPTIONALITY" as specific requirements, since it's
        rather superflous.

   11.  Other editorial changes to remove redundant text/sections.

   Changes from RFC4244 to barnes-sip-4244bis-00:

   1.  Clarified that HI captures both retargeting as well as cases of
       just forwarding a request.

   2.  Added descriptions of the usage of the terms "retarget",
       "forward" and "redirect" to the terminology section.

   3.  Added additional examples for the functionality provided by HI
       for core SIP.

   4.  Added hi-target parameter values to HI header to ABNF and
       protocol description, as well as defining proxy, UAC and UAS
       behavior for the parameter.

   5.  Simplified example call flow in section 4.5.  Moved previous call
       flow to appendix.

   6.  Fixed ABNF per RFC4244 errata "dot" -> "." and added new
       parameter.


11.  References

11.1.  Normative References

   [RFC3261]  Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston,
              A., Peterson, J., Sparks, R., Handley, M., and E.
              Schooler, "SIP: Session Initiation Protocol", RFC 3261,
              June 2002.

   [RFC3326]  Schulzrinne, H., Oran, D., and G. Camarillo, "The Reason
              Header Field for the Session Initiation Protocol (SIP)",
              RFC 3326, December 2002.

   [RFC3323]  Peterson, J., "A Privacy Mechanism for the Session
              Initiation Protocol (SIP)", RFC 3323, November 2002.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.




Barnes & Audet          Expires December 13, 2009              [Page 29]

Internet-Draft                History-Info                     June 2009


   [RFC5246]  Dierks, T. and E. Rescorla, "The Transport Layer Security
              (TLS) Protocol Version 1.2", RFC 5246, August 2008.

   [RFC4244]  Barnes, M., "An Extension to the Session Initiation
              Protocol (SIP) for Request History Information", RFC 4244,
              November 2005.

11.2.  Informative References

   [I-D.ietf-sip-gruu]
              Rosenberg, J., "Obtaining and Using Globally Routable User
              Agent (UA) URIs (GRUU) in the  Session Initiation Protocol
              (SIP)", draft-ietf-sip-gruu-15 (work in progress),
              October 2007.

   [I-D.ietf-sip-sips]
              Audet, F., "The use of the SIPS URI Scheme in the Session
              Initiation Protocol (SIP)", draft-ietf-sip-sips-09 (work
              in progress), November 2008.

   [I-D.rosenberg-sip-target-uri-delivery]
              Rosenberg, J., Elburg, H., Holmberg, C., Audet, F., and S.
              Schubert, "Delivery of Request-URI Targets to User
              Agents", draft-rosenberg-sip-target-uri-delivery-01 (work
              in progress), March 2009.

   [RFC3087]  Campbell, B. and R. Sparks, "Control of Service Context
              using SIP Request-URI", RFC 3087, April 2001.

   [RFC4240]  Burger, E., Van Dyke, J., and A. Spitzer, "Basic Network
              Media Services with SIP", RFC 4240, December 2005.


Appendix A.  Detailed call flows

   The scenarios in this section provide sample use cases for the
   History-Info header for informational purposes only.  They are not
   intended to be normative.

A.1.  Sequentially Forking (History-Info in Response)

   This scenario highlights an example where the History-Info in the
   response is useful to an application or user that originated the
   request.

   Alice sends a call to Bob via sip:example.com.  The proxy sip:
   example.com sequentially tries Bob on a SIP UA that has bound a
   contact with the sip:bob@example.com AOR, and then several alternate



Barnes & Audet          Expires December 13, 2009              [Page 30]

Internet-Draft                History-Info                     June 2009


   addresses (Office and Home) unsuccessfully before sending a response
   to Alice.  In this example, note that Office and Home are not the
   same AOR as sip:bob@example.com, but rather different AORs that have
   been configured as alternate contacts for Bob in the proxy.  In other
   words, Office and Bob are not bound through SIP Registration with
   Bob's AOR.  This type of arrangement is common for example when a
   "routing" rule to a PSTN number is manually configured in a Proxy.

   This scenario is provided to show that by providing the History-Info
   to Alice, the end-user or an application at Alice could make a
   decision on how best to attempt finding Bob. Without this mechanism,
   Alice might well attempt Office (and thus Home) and then re-attempt
   Home on a third manual attempt at reaching Bob. With this mechanism,
   either the end-user or application could know that Bob is not
   answering in the Office, and his busy on his home phone.  If there
   were an alternative address for Bob known to this end-user or
   application, that hasn't been attempted, then either the application
   or the end- user could attempt that.  The intent here is to highlight
   an example of the flexibility of this mechanism that enables
   applications well beyond SIP as it is certainly well beyond the scope
   of this document to prescribe detailed applications.






























Barnes & Audet          Expires December 13, 2009              [Page 31]

Internet-Draft                History-Info                     June 2009


   Alice   example.com            Bob     Office    Home
   |            |                  |        |        |
   | INVITE F1  |                  |        |        |
   |----------->|    INVITE F2     |        |        |
   |            |----------------->|        |        |
   | 100 Trying F3                 |        |        |
   |<-----------|  302 Move Temporarily F4  |        |
   |            |<-----------------|        |        |
   |            |   ACK F5         |        |        |
   |            |----------------->|        |        |
   |            |       INVITE F6           |        |
   |            |-------------------------->|        |
   |            |      180 Ringing F7       |        |
   |            |<--------------------------|        |
   |  180 Ringing F8                        |        |
   |<-----------|   retransmit INVITE       |        |
   |            |-------------------------->|        |
   |            |      ( timeout )          |        |
   |            |             INVITE F9              |
   |            |----------------------------------->|
   |            |           100 Trying F10           |
   |            |<-----------------------------------|
   |            |           486 Busy Here F11        |
   |            |<-----------------------------------|
   |  486 Busy Here F12                              |
   |<-----------|             ACK F13                |
   |            |----------------------------------->|
   |  ACK F14   |                                    |
   |----------->|                                    |


   Message Details

   F1 INVITE alice -> example.com

   INVITE sip:alice@example.com SIP/2.0
   Via: SIP/2.0/TCP 192.0.2.3:5060
   From: Alice <sip:alice@example.com>
   To: Bob <sip:bob@example.com>
   Supported: histinfo
   Call-Id: 12345600@example.com
   CSeq: 1 INVITE
   Contact: Alice <sip:alice@192.0.2.3>
   Content-Type: application/sdp
   Content-Length: <appropriate value>
   <!-- SDP Not Shown -->





Barnes & Audet          Expires December 13, 2009              [Page 32]

Internet-Draft                History-Info                     June 2009


   F2 INVITE  example.com -> Bob

   INVITE sip:bob@192.0.2.4 SIP/2.0
   Via: SIP/2.0/TCP proxy.example.com:5060
   Via: SIP/2.0/TCP 192.0.2.3:5060
   From: Alice <sip:alice@example.com>
   To: Bob <sip:bob@example.com>
   Supported: histinfo
   Call-Id: 12345600@example.com
   CSeq: 1 INVITE
   Record-Route: <sip:proxy.example.com;lr>
   History-Info: <sip:bob@example.com>;index=1;reg-uri
   History-Info: <sip:bob@192.0.2.4>;index=1.1
   Contact: Alice <sip:alice@192.0.2.3>
   Content-Type: application/sdp
   Content-Length: <appropriate value>
   <!-- SDP Not Shown -->


   F3 100 Trying example.com -> alice

   SIP/2.0 100 Trying
   Via: SIP/2.0/TCP 192.0.2.3:5060
   From: Alice <sip:alice@example.com>
   To: Bob <sip:bob@example.com>
   Call-Id: 12345600@example.com
   CSeq: 1 INVITE
   Content-Length: 0


   F4 302 Moved Temporarily Bob -> example.com

   SIP/2.0 302 Moved Temporarily
   Via: SIP/2.0/TCP proxy.example.com:5060
   Via: SIP/2.0/TCP 192.0.2.3:5060
   From: Alice <sip:alice@example.com>
   To: Bob <sip:bob@example.com>;tag=3
   Call-Id: 12345600@example.com
   CSeq: 1 INVITE
   Record-Route: <sip:proxy.example.com;lr>
   History-Info: <sip:bob@example.com>;index=1;reg-uri
   History-Info: <sip:bob@192.0.2.4>;index=1.1
   Contact: <sip:office@example.com>
   Content-Length: 0







Barnes & Audet          Expires December 13, 2009              [Page 33]

Internet-Draft                History-Info                     June 2009


   F5 ACK 192.0.2.4 -> Bob

   ACK sip:home@example.com SIP/2.0
   Via: SIP/2.0/TCP proxy.example.com:5060
   From: Alice <sip:alice@example.com>
   To: Bob <sip:bob@example.com>
   Call-Id: 12345600@example.com
   CSeq: 1 ACK
   Content-Length: 0


   F6 INVITE example.com -> office

   INVITE sip:office@192.0.2.3.com SIP/2.0
   Via: SIP/2.0/TCP proxy.example.com:5060;branch=2
   Via: SIP/2.0/TCP 192.0.2.3:5060
   From: Alice <sip:alice@example.com>
   To: Bob <sip:bob@example.com>
   Supported: histinfo
   Call-Id: 12345600@example.com
   Record-Route: <sip:proxy.example.com;lr>
   History-Info: <sip:bob@example.com>;index=1;reg-uri
   History-Info: <sip:bob@192.0.2.4?Reason=SIP;cause=302>;\
                 index=1.1;mapped
   History-Info: <sip:office@example.com>;index=1.2;reg-uri
   History-Info: <sip:office@192.0.2.5>;index=1.2.1
   CSeq: 1 INVITE
   Contact: Alice <sip:alice@192.0.2.3>
   Content-Type: application/sdp
   Content-Length: <appropriate value>
   <!-- SDP Not Shown -->




















Barnes & Audet          Expires December 13, 2009              [Page 34]

Internet-Draft                History-Info                     June 2009


   F7 180 Ringing office -> example.com

   SIP/2.0 180 Ringing
   Via: SIP/2.0/TCP proxy.example.com:5060;branch=2
   Via: SIP/2.0/TCP 192.0.2.3:5060
   From: Alice <sip:alice@example.com>
   To: Bob <sip:bob@example.com>;tag=5
   Supported: histinfo
   Call-ID: 12345600@example.com
   Record-Route: <sip:proxy.example.com;lr>
   History-Info: <sip:bob@example.com>;index=1;reg-uri
   History-Info: <sip:bob@192.0.2.4?Reason=SIP;cause=302>;\
                 index=1.1;mapped
   History-Info: <sip:office@example.com>;index=1.2;reg-uri
   History-Info: <sip:office@192.0.2.5>;index=1.2.1
   CSeq: 1 INVITE
   Content-Length: 0


   F8 180 Ringing example.com -> alice

   SIP/2.0 180 Ringing
   Via: SIP/2.0/TCP example.com:5060
   From: Alice <sip:alice@example.com>
   To: Bob <sip:bob@example.com>
   Supported: histinfo
   Call-Id: 12345600@example.com
   History-Info: <sip:bob@example.com>;index=1;reg-uri
   History-Info: <sip:bob@192.0.2.4?Reason=SIP;cause=302>;\
                 index=1.1;mapped
   History-Info: <sip:office@example.com>;index=1.2;reg-uri
   History-Info: <sip:office@192.0.2.5>;index=1.2.1
   CSeq: 1 INVITE
   Content-Length: 0

















Barnes & Audet          Expires December 13, 2009              [Page 35]

Internet-Draft                History-Info                     June 2009


   F9 INVITE example.com -> home

   INVITE sip:home@192.0.2.6 SIP/2.0
   Via: SIP/2.0/TCP proxy.example.com:5060;branch=3
   Via: SIP/2.0/TCP 192.0.2.3:5060
   From: Alice <sip:alice@example.com>
   To: Bob <sip:bob@example.com>
   Supported: histinfo
   Call-Id: 12345600@example.com
   Record-Route: <sip:proxy.example.com;lr>
   History-Info: <sip:bob@example.com>;index=1;reg-uri
   History-Info: <sip:bob@192.0.2.4?Reason=SIP;cause=302>;\
                 index=1.1;mapped
   History-Info: <sip:office@example.com>;index=1.2;reg-uri
   History-Info: <sip:office@192.0.2.5?Reason=SIP;cause=480>;\
                 index=1.2.1;mapped
   History-Info: <sip:home@example.com>;index=1.3;reg-uri
   History-Info: <sip:home@192.0.2.6>;index=1.3.1
   CSeq: 1 INVITE
   Contact: Alice <sip:alice@192.0.2.3>
   Content-Type: application/sdp
   Content-Length: <appropriate value>
   <!-- SDP Not Shown -->


   F10 100 Trying home -> example.com

   SIP/2.0 100 Trying
   Via: SIP/2.0/TCP proxy.example.com:5060;branch=3
   Via: SIP/2.0/TCP 192.0.2.3:5060
   From: Alice <sip:alice@example.com>
   To: Bob <sip:bob@example.com>
   Call-Id: 12345600@example.com
   CSeq: 1 INVITE
   Content-Length: 0
















Barnes & Audet          Expires December 13, 2009              [Page 36]

Internet-Draft                History-Info                     June 2009


   F11 486 Busy Here home -> example.com

   SIP/2.0  486 Busy Here
   Via: SIP/2.0/TCP proxy.example.com:5060;branch=3
   Via: SIP/2.0/TCP 192.0.2.3:5060
   From: Alice <sip:alice@example.com>
   To: Bob <sip:bob@example.com>
   Call-Id: 12345600@example.com
   Record-Route: <sip:proxy.example.com;lr>
   History-Info: <sip:bob@example.com>;index=1;reg-uri
   History-Info: <sip:bob@192.0.2.4?Reason=SIP;cause=302>;\
                 index=1.1;mapped
   History-Info: <sip:office@example.com>;index=1.2;reg-uri
   History-Info: <sip:office@192.0.2.5?Reason=SIP;cause=480>;\
                 index=1.2.1;mapped
   History-Info: <sip:home@example.com>;index=1.3;reg-uri
   History-Info: <sip:home@192.0.2.6>;index=1.3.1
   CSeq: 1 INVITE
   Content-Length: 0


   F12 486 Busy Here example.com -> alice

   SIP/2.0  486 Busy Here
   Via: SIP/2.0/TCP 192.0.2.3:5060
   From: Alice <sip:alice@example.com>
   To: Bob <sip:bob@example.com>
   Call-Id: 12345600@example.com
   History-Info: <sip:bob@example.com>;index=1;reg-uri
   History-Info: <sip:bob@192.0.2.4?Reason=SIP;cause=302>;\
                 index=1.1;mapped
   History-Info: <sip:office@example.com>;index=1.2;reg-uri
   History-Info: <sip:office@192.0.2.5?Reason=SIP;cause=480>;\
                 index=1.2.1;mapped
   History-Info: <sip:home@example.com>;index=1.3;reg-uri
   History-Info: <sip:home@192.0.2.6>;index=1.3.1
   CSeq: 1 INVITE
   Content-Length: 0













Barnes & Audet          Expires December 13, 2009              [Page 37]

Internet-Draft                History-Info                     June 2009


   F13 ACK example.com -> home

   ACK sip:home@example.com SIP/2.0
   Via: SIP/2.0/TCP proxy.example.com:5060
   From: Alice <sip:alice@example.com>
   To: Bob <sip:bob@example.com>
   Call-Id: 12345600@example.com
   CSeq: 1 ACK
   Content-Length: 0


   F14 ACK alice -> example.com

   ACK sip:bob@example.com SIP/2.0
   Via: SIP/2.0/TCP 192.0.2.3:5060
   From: Alice <sip:alice@example.com>
   To: Bob <sip:bob@example.com>
   Call-Id: 12345600@example.com
   Route: <sip:proxy.example.com;lr>
   CSeq: 1 ACK
   Content-Length: 0


A.2.  Voicemail

   This scenario highlights an example where the History-Info in the
   request is primarily of use by an edge service (e.g., voicemail
   server).  It should be noted that this is not intended to be a
   complete specification for this specific edge service as it is quite
   likely that additional information is needed by the edge service.
   History-Info is just one building block that this service makes use
   of.

   Alice called Bob, which had been forwarded to Carol, which forwarded
   to VM (voicemail server).  Based upon the retargeted URIs and Reasons
   (and other information) in the INVITE, the VM server makes a policy
   decision about what mailbox to use, which greeting to play, etc.

   Alice      example.com       Bob          Carol        VM

   | INVITE sip:bob@example.com  |             |          |
   |------------->|              |             |          |
   |              | INVITE sip:bob@192.0.2.3   |          |
   |              |------------->|             |          |
     History-Info: <sip:bob@example.com>;index=1;reg-uri
     History-Info: <sip:bob@192.0.2.3>;index=1.1
   |              |              |             |          |
   |  100 Trying  |              |             |          |



Barnes & Audet          Expires December 13, 2009              [Page 38]

Internet-Draft                History-Info                     June 2009


   |<-------------| 302 Moved Temporarily      |          |
   |              |<-------------|             |          |
     History-Info: <sip:bob@example.com>;index=1;reg-uri
     History-Info: <sip:bob@192.0.2.3>;index=1.1
   |              |              |             |          |
   |              | INVITE sip:Carol@192.0.2.4 |          |
   |              |--------------------------->|          |
     History-Info: <sip:bob@example.com>;index=1;reg-uri
     History-Info: <sip:bob@192.0.2.3>;index=1.1;mapped
     History-Info: <sip:carol@example.com>;index=2;reg-uri
     History-Info: <sip:carol@192.0.2.4>;index=2.1
   |              |              |             |          |
   |              |         180 Ringing        |          |
   |              |<---------------------------|          |
     History-Info: <sip:bob@example.com>;index=1;reg-uri
     History-Info: <sip:bob@192.0.2.3>;index=1.1;mapped
     History-Info: <sip:carol@example.com>;index=2;reg-uri
     History-Info: <sip:carol@192.0.2.4>;index=2.1
   |              |              |             |          |
   | 180 Ringing  |              |             |          |
   |<-------------|              |             |          |
   |              |              |             |          |
   |  . . .       |      retransmit INVITE     |          |
   |              |--------------------------->|          |
     History-Info: <sip:bob@example.com>;index=1;reg-uri
     History-Info: <sip:bob@192.0.2.3>;index=1.1;mapped
     History-Info: <sip:carol@example.com>;index=2;reg-uri
     History-Info: <sip:carol@192.0.2.4>;index=2.1
   |  . . .       |              |             |          |
   |              |       (timeout)            |          |
   |              |              |             |          |
   |              | INVITE sip:vm@192.0.2.5               |
   |              |-------------------------------------->|
     History-Info: <sip:bob@example.com>;index=1;reg-uri
     History-Info: <sip:bob@192.0.2.3>;index=1.1;mapped
     History-Info: <sip:carol@example.com>;index=2;reg-uri
     History-Info: <sip:carol@192.0.2.4>;index=2.1;mapped
     History-Info: <sip:vm@example.com>;index=3;reg-uri
     History-Info: <sip:vm@192.0.2.5>;index=3.1
   |              |              |             |          |
   |              |               200 OK                  |
   |              |<--------------------------------------|
     History-Info: <sip:bob@example.com>;index=1;reg-uri
     History-Info: <sip:bob@192.0.2.3>;index=1.1;mapped
     History-Info: <sip:carol@example.com>;index=2;reg-uri
     History-Info: <sip:carol@192.0.2.4>;index=2.1;mapped
     History-Info: <sip:vm@example.com>;index=3;reg-uri
     History-Info: <sip:vm@192.0.2.5>;index=3.1



Barnes & Audet          Expires December 13, 2009              [Page 39]

Internet-Draft                History-Info                     June 2009


   |   200 OK     |              |             |          |
   |<-------------|              |             |          |
   |              |              |             |          |
   |     ACK      |              |             |          |
   |------------->|                    ACK                |
   |              |-------------------------------------->|


A.3.  Automatic Call Distribution

   This scenario highlights an example of an Automatic Call Distribution
   service, where the agents are divided into groups based upon the type
   of customers they handle.  In this example, the Gold customers are
   given higher priority than Silver customers, so a Gold call would get
   serviced even if all the agents servicing the Gold group were busy,
   by retargeting the request to the Silver Group for delivery to an
   agent.  Upon receipt of the call at the agent assigned to handle the
   incoming call, based upon the History-Info header in the message, the
   application at the agent can provide an indication that this is a
   Gold call, from how many groups it might have overflowed before
   reaching the agent, etc. and thus can be handled appropriately by the
   agent.

   For scenarios whereby calls might overflow from the Silver to the
   Gold, clearly the alternate group identification, internal routing,
   or actual agent that handles the call should not be sent to UA1.
   Thus, for this scenario, one would expect that the Proxy would not
   support the sending of the History-Info in the response, even if
   requested by Alice.

   As with the other examples, this is not prescriptive of how one would
   do this type of service but an example of a subset of processing that
   might be associated with such a service.  In addition, this example
   is not addressing any aspects of Agent availability, which might also
   be done via a SIP interface.

   Alice       example.com     Gold          Silver       Agent

   |              |              |             |            |
   | INVITE sip:Gold@example.com |             |            |
   |------------->|              |             |            |
   | Supported: histinfo
   |              |              |             |            |
   |              |  INVITE sip:Gold@example.com            |
   |              |------------->|             |            |
     History-Info: <sip:Gold@example.com>;index=1;noop
     History-Info: <sip:Gold@gold.example.com>;index=1.1
   |              |              |             |            |



Barnes & Audet          Expires December 13, 2009              [Page 40]

Internet-Draft                History-Info                     June 2009


   |              |  302 Moved Temporarily     |            |
   |              |<-------------|             |            |
     History-Info: <sip:Gold@example.com>;index=1;noop
     History-Info: <sip:Gold@gold.example.com>;index=1.1
     Contact: <sip:Silver@example.com>
                  |              |             |            |
   |              |  INVITE sip:Silver@example.com          |
   |              |--------------------------->|            |
     History-Info: <sip:Gold@example.com>;index=1;noop
     History-Info: <sip:Gold@gold.example.com?Reason=SIP;cause=302>;\
                   index=1.1;mapped
     History-Info: <sip:Silver@example.com>;index=2;noop
     History-Info: <sip:Silver@silver.example.com>;index=2.1
   |              |              |             |            |
   |              |              | INVITE sip:Silver@192.0.2.7
   |              |              |             |----------->|
     History-Info: <sip:Gold@example.com>;index=1;noop
     History-Info: <sip:Gold@gold.example.com?Reason=SIP;cause=302>;\
                   index=1.1;mapped
     History-Info: <sip:Silver@example.com>;index=2;noop
     History-Info: <sip:Silver@silver.example.com>;index=2.1;reg-id
     History-Info: <sip:Silver@192.0.2.7>;index=2.1.1>
   |              |              |             |            |
   |              |              |             |  200 OK    |
   |              |              |             |<-----------|
     History-Info: <sip:Gold@example.com>;index=1;noop
     History-Info: <sip:Gold@gold.example.com?Reason=SIP;cause=302>;\
                   index=1.1;mapped
     History-Info: <sip:Silver@example.com>;index=2;noop
     History-Info: <sip:Silver@silver.example.com>;index=2.1;reg-id
     History-Info: <sip:Silver@192.0.2.7>;index=2.1.1>
   |              |              |             |            |
   |              |         200 OK             |            |
   |              |<---------------------------|            |
     History-Info: <sip:Gold@example.com>;index=1;noop
     History-Info: <sip:Gold@gold.example.com?Reason=SIP;cause=302>;\
                   index=1.1;mapped
     History-Info: <sip:Silver@example.com>;index=2;noop
     History-Info: <sip:Silver@silver.example.com>;index=2.1;reg-id
     History-Info: <sip:Silver@192.0.2.7>;index=2.1.1>
   |              |              |             |            |
      200 OK      |              |             |            |
   |<-------------|              |             |            |
   |              |              |             |            |
   |    ACK       |              |             |            |
   |------------->|                  ACK                    |
   |              |---------------------------------------->|




Barnes & Audet          Expires December 13, 2009              [Page 41]

Internet-Draft                History-Info                     June 2009


Authors' Addresses

   Mary Barnes
   Nortel
   Richardson, TX

   Email: mary.barnes@nortel.com


   Francois Audet
   Nortel
   4655 Great America Parkway
   Santa Clara, CA  95054
   US

   Email: audet@nortel.com



































Barnes & Audet          Expires December 13, 2009              [Page 42]



